In [2]:
pwd

'C:\\Users\\audei\\Documents\\Capstone'

In [27]:
import pandas as pd
import sqlalchemy
engine = sqlalchemy.create_engine('mysql+pymysql://sha2user:Boot!camp2021!@localhost/capstone')
dbconnection = engine.connect()

In [28]:
df = pd.read_sql("SELECT * FROM orders", dbconnection)

Data types of columns

In [30]:
df.tail()

          item   empid  dateyr  datewk  quantity
8318   ESP_008  EMP290    2020      50         0
8319   ESP_008  EMP290    2020      51         0
8320  PROD_005  EMP244    2021      14        20
8321  PROD_005  EMP244    2021      14        20
8322   PROD_07  EMP244    2021      14        12

            Showcase basic information about the database such as the count of each row

                                                Count per table

In [ ]:
df.count()

                                                The top of the database

In [ ]:
df.head()

                                                 The end of the database

In [31]:
df.tail()

          item   empid  dateyr  datewk  quantity
8318   ESP_008  EMP290    2020      50         0
8319   ESP_008  EMP290    2020      51         0
8320  PROD_005  EMP244    2021      14        20
8321  PROD_005  EMP244    2021      14        20
8322   PROD_07  EMP244    2021      14        12

Group by employee ID and sum the quantity of all the items each employee has sold

In [32]:
df.groupby('empid').agg({ 'quantity': 'sum'})

        quantity
empid
EMP234     23316
EMP244     33229
EMP256     15364
EMP267     33013
EMP290     10179

In [33]:
df2 = pd.read_sql("SELECT * FROM prices", dbconnection)

                                                            Count per table

In [21]:
df2.count()

item      16
2019Q1    16
2019Q2    16
2019Q3    16
2019Q4    16
2020Q1    16
2020Q2    16
2020Q3    16
2020Q4    16
dtype: int64

                                               Data types of columns

In [ ]:
df2.dtypes

In [ ]:
                           Showcase basic information about the database such as the count of each row
                                         The top of the database
                                        The end of the database

In [ ]:
df2.count()
df2.head()
df2.tail()

                                             Read the employees table

In [34]:
df3 = pd.read_sql("SELECT * FROM employees", dbconnection)

                        Merge table 1 with three with their common column empid to show quantity sold by region

In [35]:
dfm= pd.merge(df, df3, on='empid', how='left')

In [37]:
dfm.groupby('Region').agg({ 'quantity': 'sum'})

        quantity
Region
NW         71909
SW         43192